<a href="https://colab.research.google.com/github/masum-auch/AI-Engineer/blob/main/Numpy%20%26%20Pandas/Pandas/02_basic_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas fundamentals

### What is Pandas

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

### Pandas Series

A Pandas Series is like a column in a table. It is a 1-D array holding data of any type.

In [1]:
import pandas as pd
import numpy as np

In [2]:
#string
fruit= ['apple', 'banana', 'cherry', 'orange', 'komola']
pd.Series(fruit)

0     apple
1    banana
2    cherry
3    orange
4    komola
dtype: object

In [5]:
#intiger
price= [67, 85, 78, 98, 59]
pd.Series(price)

0    67
1    85
2    78
3    98
4    59
dtype: int64

In [4]:
#coustom index
price= [67, 85, 78, 98, 59]
pd.Series(price, index= fruit)

apple     67
banana    85
cherry    78
orange    98
komola    59
dtype: int64

In [8]:
#index name
wner_name= pd.Series(price, index= fruit, name= 'Owner by Rabby hasan')
owner_name

apple     67
banana    85
cherry    78
orange    98
komola    59
Name: Owner by Rabby hasan, dtype: int64

In [19]:
#series from dict
marks = {
    'maths':67,
    'english':57,
    'science':89,
    'hindi':100
}

marks_series = pd.Series(marks,name='nitish ar marks')
marks_series

maths       67
english     57
science     89
hindi      100
Name: nitish ar marks, dtype: int64

In [20]:
#size
marks_series.size

4

In [21]:
#dtype
marks_series.dtype

dtype('int64')

In [22]:
#unique
marks_series.is_unique
#1 bar item true,, same item akadik bar too false
#false unique
# pd.Series([1,1,2,3,4,5]).is_unique

True

In [23]:
#index
marks_series.index

Index(['maths', 'english', 'science', 'hindi'], dtype='object')

In [26]:
price= [67, 85, 78, 98, 59]
most_prices= pd.Series(price)
most_prices.index

RangeIndex(start=0, stop=5, step=1)

In [28]:
#values
marks_series.values

array([ 67,  57,  89, 100])